; ModuleID = '.bio_lib.o.bc'
source_filename = "bio_lib.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bio_st = type { %struct.bio_method_st*, i64 (%struct.bio_st*, i32, i8*, i32, i64, i64)*, i8*, i32, i32, i32, i32, i32, i8*, %struct.bio_st*, %struct.bio_st*, i32, i64, i64, %struct.crypto_ex_data_st }
%struct.crypto_ex_data_st = type { %struct.stack_st_void*, i32 }
%struct.stack_st_void = type { %struct.stack_st }
%struct.stack_st = type { i32, i8**, i32, i32, i32 (i8*, i8*)* }
%struct.bio_method_st = type { i32, i8*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*, i32)*, i32 (%struct.bio_st*, i8*)*, i32 (%struct.bio_st*, i8*, i32)*, i64 (%struct.bio_st*, i32, i64, i8*)*, i32 (%struct.bio_st*)*, i32 (%struct.bio_st*)*, i64 (%struct.bio_st*, i32, void (%struct.bio_st*, i32, i8*, i32, i64, i64)*)* }

@.str = private unnamed_addr constant [10 x i8] c"bio_lib.c\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [31 x i8] c"BIO_free, bad reference count\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "bio_lib.c", directory: "/opt/openssl/openssl/crypto/bio")
!2 = !{}
!3 = !{!4, !15, !39, !69, !38, !28}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !6, line: 231, baseType: !7)
!6 = !DIFile(filename: "../../include/openssl/bio.h", directory: "/opt/openssl/openssl/crypto/bio")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !6, line: 310, size: 896, elements: !8)
!8 = !{!9, !54, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !70, !71}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !7, file: !6, line: 312, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !6, line: 308, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !6, line: 296, size: 640, elements: !13)
!13 = !{!14, !16, !20, !24, !29, !33, !34, !40, !44, !45}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !6, line: 298, baseType: !15, size: 32)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !6, line: 299, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !12, file: !6, line: 300, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{!15, !4, !17, !15}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !12, file: !6, line: 301, baseType: !25, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!15, !4, !28, !15}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !12, file: !6, line: 302, baseType: !30, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!15, !4, !17}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !12, file: !6, line: 303, baseType: !25, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !12, file: !6, line: 304, baseType: !35, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !4, !15, !38, !39}
!38 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !12, file: !6, line: 305, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!15, !4}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !12, file: !6, line: 306, baseType: !41, size: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !12, file: !6, line: 307, baseType: !46, size: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!38, !4, !15, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "bio_info_cb", file: !6, line: 294, baseType: !51)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53, !15, !17, !15, !38, !38}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !7, file: !6, line: 314, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!38, !53, !15, !17, !15, !38, !38}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !7, file: !6, line: 315, baseType: !28, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !7, file: !6, line: 317, baseType: !15, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !7, file: !6, line: 318, baseType: !15, size: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !6, line: 319, baseType: !15, size: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "retry_reason", scope: !7, file: !6, line: 320, baseType: !15, size: 32, offset: 288)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !7, file: !6, line: 321, baseType: !15, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !7, file: !6, line: 322, baseType: !39, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next_bio", scope: !7, file: !6, line: 323, baseType: !53, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bio", scope: !7, file: !6, line: 324, baseType: !53, size: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !7, file: !6, line: 325, baseType: !15, size: 32, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "num_read", scope: !7, file: !6, line: 326, baseType: !69, size: 64, offset: 640)
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "num_write", scope: !7, file: !6, line: 327, baseType: !69, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !7, file: !6, line: 329, baseType: !72, size: 128, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !73, line: 189, baseType: !74)
!73 = !DIFile(filename: "../../include/openssl/ossl_typ.h", directory: "/opt/openssl/openssl/crypto/bio")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !75, line: 285, size: 128, elements: !76)
!75 = !DIFile(filename: "../../include/openssl/crypto.h", directory: "/opt/openssl/openssl/crypto/bio")
!76 = !{!77, !97}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !74, file: !75, line: 287, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !75, line: 290, size: 256, elements: !80)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !79, file: !75, line: 290, baseType: !82, size: 256)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !83, line: 74, baseType: !84)
!83 = !DIFile(filename: "../../include/openssl/stack.h", directory: "/opt/openssl/openssl/crypto/bio")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !83, line: 66, size: 256, elements: !85)
!85 = !{!86, !87, !89, !90, !91}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !84, file: !83, line: 68, baseType: !15, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !83, line: 69, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !84, file: !83, line: 70, baseType: !15, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !84, file: !83, line: 72, baseType: !15, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !84, file: !83, line: 73, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!15, !95, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !74, file: !75, line: 288, baseType: !15, size: 32, offset: 64)
!98 = !{i32 7, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{i32 1, !"wchar_size", i32 4}
!101 = !{i32 7, !"PIC Level", i32 2}
!102 = !{!"clang version 10.0.0-4ubuntu1 "}
!103 = distinct !DISubprogram(name: "BIO_new", scope: !1, file: !1, line: 66, type: !104, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!104 = !DISubroutineType(types: !105)
!105 = !{!4, !10}
!106 = !DILocalVariable(name: "method", arg: 1, scope: !103, file: !1, line: 66, type: !10)
!107 = !DILocation(line: 66, column: 26, scope: !103)
!108 = !DILocalVariable(name: "ret", scope: !103, file: !1, line: 68, type: !4)
!109 = !DILocation(line: 68, column: 7, scope: !103)
!110 = !DILocation(line: 70, column: 13, scope: !103)
!111 = !DILocation(line: 70, column: 6, scope: !103)
!112 = !DILocation(line: 70, column: 5, scope: !103)
!113 = !DILocation(line: 71, column: 6, scope: !114)
!114 = distinct !DILexicalBlock(scope: !103, file: !1, line: 71, column: 6)
!115 = !DILocation(line: 71, column: 10, scope: !114)
!116 = !DILocation(line: 71, column: 6, scope: !103)
!117 = !DILocation(line: 73, column: 3, scope: !118)
!118 = distinct !DILexicalBlock(scope: !114, file: !1, line: 72, column: 3)
!119 = !DILocation(line: 74, column: 3, scope: !118)
!120 = !DILocation(line: 76, column: 15, scope: !121)
!121 = distinct !DILexicalBlock(scope: !103, file: !1, line: 76, column: 6)
!122 = !DILocation(line: 76, column: 19, scope: !121)
!123 = !DILocation(line: 76, column: 7, scope: !121)
!124 = !DILocation(line: 76, column: 6, scope: !103)
!125 = !DILocation(line: 78, column: 3, scope: !126)
!126 = distinct !DILexicalBlock(scope: !121, file: !1, line: 77, column: 3)
!127 = !DILocation(line: 79, column: 6, scope: !126)
!128 = !DILocation(line: 80, column: 3, scope: !126)
!129 = !DILocation(line: 81, column: 9, scope: !103)
!130 = !DILocation(line: 81, column: 2, scope: !103)
!131 = !DILocation(line: 82, column: 2, scope: !103)
!132 = distinct !DISubprogram(name: "BIO_set", scope: !1, file: !1, line: 84, type: !133, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!133 = !DISubroutineType(types: !134)
!134 = !{!15, !4, !10}
!135 = !DILocalVariable(name: "bio", arg: 1, scope: !132, file: !1, line: 84, type: !4)
!136 = !DILocation(line: 84, column: 18, scope: !132)
!137 = !DILocalVariable(name: "method", arg: 2, scope: !132, file: !1, line: 84, type: !10)
!138 = !DILocation(line: 84, column: 35, scope: !132)
!139 = !DILocation(line: 86, column: 14, scope: !132)
!140 = !DILocation(line: 86, column: 2, scope: !132)
!141 = !DILocation(line: 86, column: 7, scope: !132)
!142 = !DILocation(line: 86, column: 13, scope: !132)
!143 = !DILocation(line: 87, column: 2, scope: !132)
!144 = !DILocation(line: 87, column: 7, scope: !132)
!145 = !DILocation(line: 87, column: 15, scope: !132)
!146 = !DILocation(line: 88, column: 2, scope: !132)
!147 = !DILocation(line: 88, column: 7, scope: !132)
!148 = !DILocation(line: 88, column: 13, scope: !132)
!149 = !DILocation(line: 89, column: 2, scope: !132)
!150 = !DILocation(line: 89, column: 7, scope: !132)
!151 = !DILocation(line: 89, column: 11, scope: !132)
!152 = !DILocation(line: 90, column: 2, scope: !132)
!153 = !DILocation(line: 90, column: 7, scope: !132)
!154 = !DILocation(line: 90, column: 15, scope: !132)
!155 = !DILocation(line: 91, column: 2, scope: !132)
!156 = !DILocation(line: 91, column: 7, scope: !132)
!157 = !DILocation(line: 91, column: 12, scope: !132)
!158 = !DILocation(line: 92, column: 2, scope: !132)
!159 = !DILocation(line: 92, column: 7, scope: !132)
!160 = !DILocation(line: 92, column: 19, scope: !132)
!161 = !DILocation(line: 93, column: 2, scope: !132)
!162 = !DILocation(line: 93, column: 7, scope: !132)
!163 = !DILocation(line: 93, column: 10, scope: !132)
